package model

data class Station internal constructor(
    val id: Int,
    val name: String,
    val area: String,
) {
    companion object {
        val stations = listOf(
            Station(158789, "26栋1号机", "四组团-26栋"),
            Station(158742, "26栋2号机", "四组团-26栋"),
            Station(158664, "26栋3号机", "四组团-26栋"),
            Station(158507, "27栋1号机", "四组团-27栋"),
            Station(158748, "27栋2号机", "四组团-27栋"),
            Station(158501, "27栋3号机", "四组团-27栋"),
            Station(158764, "27栋4号机", "四组团-27栋"),
            Station(158666, "27栋5号机", "四组团-27栋"),
            Station(158661, "27栋6号机", "四组团-27栋"),
            Station(158668, "27栋7号机", "四组团-27栋"),
//            Station(117387, "24栋1号机", "四组团-24栋"),
//            Station(117474, "24栋2号机", "四组团-24栋"),
//            Station(117374, "17栋（8插座）1号机", "四组团-17栋"),
//            Station(117372, "17栋（8插座）2号机", "四组团-17栋"),
//            Station(165088, "17栋（8插座）3号机", "四组团-17栋"),
//            Station(158676, "17栋（10插座）1号机", "四组团-17栋"),
//            Station(157805, "17栋（10插座）2号机", "四组团-17栋"),
//            Station(157551, "17栋（10插座）3号机", "四组团-17栋"),
//            Station(117379, "第十餐厅1号机", "三组团"),
//            Station(117392, "第十餐厅2号机", "三组团"),
//            Station(117381, "游泳馆1号机", "二组团"),
//            Station(117377, "游泳馆2号机", "二组团"),
//            Station(117375, "5栋1号机", "一组团"),
//            Station(117369, "5栋2号机", "一组团"),
        )
    }
}


